<center>
    <img src="https://fpt.edu.vn/Resources/brand/uploads/749540_132829686029858301_o.jpg" width="300" alt="AI1906"  />
 
# Lab 3: Access SQL Database Server using Python
</center>

<br>

#### Class name: AI1904

#### Student code: HE194223

#### Student name: Hoàng Hữu Quang

<br>


## Objectives

After completing this lab you will be able to:

*   Create connection with SQL Server using pyodbc
*   Query data from the table
*   Retrieve the result set into a pandas dataframe
*   Close the database connection

Estimated time needed: **60** minutes
<h4 style='color:red;'>Note:
    <ul>
    <li>The results need to display all the necessary information to verify that the data obtained is correct.</li>
    <li>Any cheater who copies or shares the code will receive 1 point.</li>
    </ul>
</h4>

**Notice:** Please follow the instructions given by lecture to import data from .csv file to SQL database server. The assignment will be graded based on the results displayed in the notebook, so the results should show enough information to prove that the results are correct.

## Import the `pyodbc` Python library

The `pyodbc` [API ](https://pypi.org/project/pyodbc/) provides a variety of useful Python functions for accessing and manipulating data with SQL Server database, including functions for connecting to a database, preparing and issuing SQL statements, fetching rows from result sets, calling stored procedures, committing and rolling back transactions, handling errors, and retrieving metadata.

We import the `pyodbc` library into our Python Application

The following required modules are pre-installed in the Annaconda environment. However if you run this notebook commands in a different Jupyter environment (e.g. Watson Studio) you may need to install these libraries by removing the `#` sign before `!pip` in the code cell below.

In [117]:
# The library are pre-installed in anaconda enviroment. If error happen when running please uncomment lines below to install them:
# !pip install pyodbc
# !pip install pandas

In [118]:
import pyodbc
import pandas as pd
import warnings

warnings.filterwarnings('ignore')

When the command above completes, the `pyodbc` and `pandas` library is loaded in your notebook.

## Identify the database connection properties

Connecting to SQL database server requires the following information:

*   Driver Name
*   Server
*   Database
*   User ID
*   User Password

In [120]:
#Replace the placeholder values with the actuals for your SQL Server connection properties
Server   = "GNS-0000T-E\VEDA"
Database = "ADY_LAB3"
UID      = "GNS-0000T-E\hoang"
PWD      = "<Replace with password if needed>"

connection_str = ("Driver={ODBC Driver 17 for SQL Server};"
                  "Server=" + Server + ";"
                  "Database=" + Database + ";"
                  "Trusted_Connection=yes;")

# connection_str = ("Driver={SQL Server Native Client 11.0};"
#                   "Server="+ Server + ";"
#                   "Database="+ Database + ";"
#                   "UID="+ UID + ";"
#                   "PWD="+ PWD + ";")

try:
    connection = pyodbc.connect(connection_str)
    print ("Connected to SQL database Server:", Server, "\nDatabase: " + Database)
except pyodbc.Error as ex:
    sqlstate = ex.args[1]
    print ("Unable to connect: ", sqlstate)

Connected to SQL database Server: GNS-0000T-E\VEDA
Database: ADY_LAB3

## Data structure understanding

This dataset shows all school level performance data used to create CPS School Report Cards for the 2011-2012 school year.

Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012_.csv <a href='https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDev'>link<a/>

You are requested import this data set into SQL Server and and discover what's inside the data.

In [122]:
# You could run the following select query to first five records of INSTRUCTOR table
query_str = "SELECT TOP(10) * FROM [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]"

data = pd.read_sql(query_str, connection)
data.head()

,School_ID,Name_of_School,Elementary_Middle_or_High_School,Street_Address,City,State,ZIP_Code,Phone_Number,Link,Network_Manager,...,RCDTS_Code,X_COORDINATE,Y_COORDINATE,Latitude,Longitude,Community_Area_Number,Community_Area_Name,Ward,Police_District,Location
0,609966,Charles G Hammond Elementary School,ES,2819 W 21st Pl,Chicago,IL,60623,(773) 535-4580,http://schoolreports.cps.edu/SchoolProgressRep...,Pilsen-Little Village Elementary Network,...,150000000000000,1.157809e+09,1.889555e+09,4.185269e+09,-8.769628e+09,30,SOUTH LAWNDALE,12,10,"(41.85269133, -87.69627777)"
1,610539,Marvin Camras Elementary School,ES,3000 N Mango Ave,Chicago,IL,60634,(773) 534-2960,http://schoolreports.cps.edu/SchoolProgressRep...,Fullerton Elementary Network,...,150000000000000,1.137482e+09,1.919395e+07,4.193497e+09,-8.777016e+09,19,BELMONT CRAGIN,30,25,"(41.93496641, -87.77016525)"
2,609852,Eliza Chappell Elementary School,ES,2135 W Foster Ave,Chicago,IL,60625,(773) 534-2390,http://schoolreports.cps.edu/SchoolProgressRep...,Ravenswood-Ridge Elementary Network,...,150000000000000,1.161017e+09,1.934467e+09,4.197587e+07,-8.768326e+09,4,LINCOLN SQUARE,47,20,"(41.975867, -87.68325438)"
3,609835,Daniel R Cameron Elementary School,ES,1234 N Monticello Ave,Chicago,IL,60651,(773) 534-4290,http://schoolreports.cps.edu/SchoolProgressRep...,Garfield-Humboldt Elementary Network,...,150000000000000,1.151768e+09,1.908130e+09,4.190378e+09,-8.771796e+09,23,HUMBOLDT PARK,26,25,"(41.90378521, -87.71796315)"
4,610521,Sir Miles Davis Magnet Elementary Academy,ES,6730 S Paulina St,Chicago,IL,60636,(773) 535-9120,http://schoolreports.cps.edu/SchoolProgressRep...,Englewood-Gresham Elementary Network,...,150000000000000,1.166134e+09,1.859929e+09,4.177122e+09,-8.766657e+09,67,WEST ENGLEWOOD,15,7,"(41.77122181, -87.66656657)"

## Task 1: Count the number of Elementary School, Middle School and High School in a query.

In [124]:
#Enter your code below
query_str = """
SELECT 
    Elementary_Middle_or_High_School,
    COUNT(*) AS School_Count
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
WHERE 
    Elementary_Middle_or_High_School IN ('ES', 'MS', 'HS')
GROUP BY 
    Elementary_Middle_or_High_School;
"""

data = pd.read_sql(query_str, connection)
data

  Elementary_Middle_or_High_School  School_Count
0                               ES           462
1                               HS            93
2                               MS            11

## Task 2: Find the school that has lowest average student attendance

In [126]:
#Enter your code below
query_str = """
SELECT 
    Name_of_School, Average_Student_Attendance
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
WHERE 
    Average_Student_Attendance = (
                                 SELECT MIN(Average_Student_Attendance)
                                 FROM [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
                                 );
"""

data = pd.read_sql(query_str, connection)
data

,Name_of_School,Average_Student_Attendance
0,Richard T Crane Technical Preparatory High School,579.0

## Task 3: Find the average environment score

In [128]:
#Enter your code below
query_str = """
SELECT 
    AVG(Environment_Score) AS Average_Environment_Score
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004];
"""

data = pd.read_sql(query_str, connection)
data

   Average_Environment_Score
0                         47

## Task 4: Find the number of Elementary School in community area WEST TOWN

In [130]:
#Enter your code below
query_str = """
SELECT 
    COUNT(*) AS Number_of_Elementary_Schools
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
WHERE 
    Community_Area_Name = 'WEST TOWN' AND
    Elementary_Middle_or_High_School = 'ES';
"""

data = pd.read_sql(query_str, connection)
data

   Number_of_Elementary_Schools
0                            17

## Task 5: Count all the High School that has name start by letter ‘C’

In [132]:
#Enter your code below
query_str = """
SELECT 
    COUNT(*) AS Number_of_High_Schools
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
WHERE 
    Elementary_Middle_or_High_School = 'HS' AND
    Name_of_School LIKE 'C%';
"""

data = pd.read_sql(query_str, connection)
data

   Number_of_High_Schools
0                       9

## Task 6: Find the top 10 Middle School has lowest Safety Score

In [134]:
#Enter your code below
query_str = """
SELECT TOP 10
    Name_of_School,
    Safety_Score
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
WHERE 
    Elementary_Middle_or_High_School = 'MS'
ORDER BY 
    Safety_Score ASC;
"""

data = pd.read_sql(query_str, connection)
data

                                      Name_of_School  Safety_Score
0  Irene C. Hernandez Middle School for the Advan...            34
1                            Northwest Middle School            34
2                                 Ames Middle School            38
3                    Thurgood Marshall Middle School            39
4                        Pershing West Middle School            46
5         Williams Preparatory Academy Middle School            49
6                   Francisco I Madero Middle School            49
7                            Logandale Middle School            56
8                      Miriam G Canter Middle School            57
9                    Evergreen Academy Middle School            60

## Task 7: Find all school has missing value in Leader Score column

In [136]:
#Enter your code below
query_str = """
SELECT 
    Name_of_School
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
WHERE 
    Leaders_Score IS NULL;
"""

data = pd.read_sql(query_str, connection)
data

                                        Name_of_School
0                  Charles G Hammond Elementary School
1                   Daniel R Cameron Elementary School
2            Sir Miles Davis Magnet Elementary Academy
3                     Luther Burbank Elementary School
4                      James N Thorp Elementary School
..                                                 ...
266  Helen Peirce International Studies Elementary ...
267         Williams Preparatory Academy Middle School
268            Robert A Black Magnet Elementary School
269   Infinity Math Science and Technology High School
270                 Daniel J Corkery Elementary School

[271 rows x 1 columns]

## Task 8: Find the safest elementary school in Ward 12.

In [138]:
#Enter your code below
query_str = """
SELECT TOP 1
    Name_of_School,
    Safety_Score
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
WHERE 
    Elementary_Middle_or_High_School = 'ES' AND
    Ward = 12
ORDER BY 
    Safety_Score DESC;
"""

data = pd.read_sql(query_str, connection)
data

                          Name_of_School  Safety_Score
0  John Spry Elementary Community School            66

## Task 9: Using only one query to find out which ZIP code has the most and how many records have that ZIP code.

In [140]:
#Enter your code below
query_str = """
SELECT TOP 1
    ZIP_Code,
    COUNT(*) AS Record_Count
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
GROUP BY 
    ZIP_Code
ORDER BY 
    Record_Count DESC;
"""

data = pd.read_sql(query_str, connection)
data

   ZIP_Code  Record_Count
0     60623            35

## Task 10: Find out which address has the most concentration of schools. List all schools at that address.

### Find the address with the most concentration of schools

In [143]:
query_str = """
WITH Address_School_Counts AS (
    SELECT 
        Street_Address,
        COUNT(*) AS School_Count
    FROM 
        [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
    GROUP BY 
        Street_Address
)
SELECT TOP 1
    Street_Address,
    School_Count
FROM 
    Address_School_Counts
ORDER BY 
    School_Count DESC;
"""

data = pd.read_sql(query_str, connection)
data

        Street_Address  School_Count
0  3120 S Kostner Ave              4

### List all schools at that address

In [145]:
query_str = """
WITH Address_School_Counts AS (
    SELECT 
        Street_Address,
        COUNT(*) AS School_Count
    FROM 
        [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
    GROUP BY 
        Street_Address
)
SELECT 
    Name_of_School,
    Street_Address
FROM 
    [Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012__20241004]
WHERE 
    Street_Address = (
        SELECT TOP 1 Street_Address
        FROM Address_School_Counts
        ORDER BY School_Count DESC
    );
"""

data = pd.read_sql(query_str, connection)
data

                                     Name_of_School       Street_Address
0                World Language Academy High School  3120 S Kostner Ave
1              Multicultural Academy of Scholarship  3120 S Kostner Ave
2   Greater Lawndale High School For Social Justice  3120 S Kostner Ave
3  Infinity Math Science and Technology High School  3120 S Kostner Ave

## Close database connection

In [162]:
connection.close()

## Summary

In this lab you established a connection to a database instance of SQL Server Warehouse from a Python notebook using `pyodbc` API. Then created a table and insert a few rows of data into it. Then queried the data. You also retrieved the data into a pandas dataframe.

## Submission into google driver link 
Link: https://drive.google.com/drive/folders/1zvF3eelIYXhptxxgv5Vwps-lEM_iWqDf?usp=sharing